DataProcessors/ТК_АнкетированиеПоЧекам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ТК_АнкетированиеПоЧекам</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Documents/Анкета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Анкета</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОтветыНаВопросыАнкет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Опрос</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НазначениеОпросов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Респондент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Респондент</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРедактирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактируемыйРаздел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВопросыШаблонаАнкеты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Интервьюер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Интервьюер</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонАнкеты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныАнкет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимАнкетирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыАнкетирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВопросыШаблонаАнкеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлементарныйВопрос</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЯчейки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответ</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВопросыДляАнкетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОткрытыйОтвет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ТК_АнкетированиеПоЧекам/Forms/ФормаАнкеты/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(Объект, Параметры);
	
	Если Не Объект.ШаблонАнкеты.Пустая() Тогда 
		Анкетирование.УстановитьКорневойЭлементДереваАнкеты(ДеревоАнкеты);
		Анкетирование.ЗаполнитьДеревоШаблонаАнкеты(ЭтотОбъект,"ДеревоАнкеты", Объект.ШаблонАнкеты);
		АнкетированиеКлиентСервер.СформироватьНумерациюДерева(ДеревоАнкеты);
		
		ДеревоАнкетыСервер = РеквизитФормыВЗначение("ДеревоАнкеты", Тип("ДеревоЗначений"));
		ЗаполнитьТаблицуВопросвРекурсивно(ДеревоАнкетыСервер.Строки, Объект.ШаблонАнкеты);	
		
		Элементы.ГруппаВопросыАнкеты.Заголовок = Строка(Объект.ШаблонАнкеты);
		
		ОтобразитьВопросыАнкеты("ДеревоАнкеты", Элементы.ГруппаВопросыАнкеты);
	КонецЕсли;
	
	Если Параметры.Свойство("ШаблонАнкетыДоп") Тогда 
		ДопШаблон_Использовать = Истина;
		
		ЗаполнитьЗначенияСвойств(ДопШаблон_Объект, Параметры);
		ДопШаблон_Объект.ШаблонАнкеты = Параметры.ШаблонАнкетыДоп;
		
		Анкетирование.УстановитьКорневойЭлементДереваАнкеты(ДопШаблон_ДеревоАнкеты);
		Анкетирование.ЗаполнитьДеревоШаблонаАнкеты(ЭтотОбъект, "ДопШаблон_ДеревоАнкеты", ДопШаблон_Объект.ШаблонАнкеты);
		АнкетированиеКлиентСервер.СформироватьНумерациюДерева(ДопШаблон_ДеревоАнкеты);
		
		ДеревоАнкетыСервер = РеквизитФормыВЗначение("ДопШаблон_ДеревоАнкеты", Тип("ДеревоЗначений"));
		ЗаполнитьТаблицуВопросвРекурсивно(ДеревоАнкетыСервер.Строки, ДопШаблон_Объект.ШаблонАнкеты);	
		
		Элементы.ГруппаВопросыАнкетыДоп.Видимость = Истина;
		Элементы.ГруппаВопросыАнкетыДоп.Заголовок = Строка(ДопШаблон_Объект.ШаблонАнкеты);
		
		ОтобразитьВопросыАнкеты("ДопШаблон_ДеревоАнкеты", Элементы.ГруппаВопросыАнкетыДоп);
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//Если Не ЗначениеЗаполнено(Параметры.Ключ) И Не ЗначениеЗаполнено(Объект.ШаблонАнкеты) Тогда 
	//	Отказ = Истина;
	//	ОткрытьФорму("Документ.Анкета.Форма.ФормаВыбораШаблона");
	//КонецЕсли;
	
	Если Не Отказ Тогда 
		Для Каждого Стр Из СписокЭлементовИсключений Цикл 
			ИсключениеВопросаПриИзменении(Элементы[Стр.Значение], Ложь);
		КонецЦикла;	
		СписокЭлементовИсключений.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	//// СтандартныеПодсистемы.УправлениеДоступом
	//Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
	//	МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
	//	МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	//КонецЕсли;
	//// Конец СтандартныеПодсистемы.УправлениеДоступом

	//
	//УстановитьСостояниеДокумента();
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИсключениеВопросаПриИзменении(Элемент, ВопросДоступен = Неопределено)

	Если ВопросДоступен = Неопределено Тогда 
		ВопросДоступен = Истина;
		
		ГУИД_Строки = Элемент.Имя;
		ГУИД_Строки = СтрЗаменить(ГУИД_Строки, "_ИсключитьВопрос", "");
		ГУИД_Строки = СтрЗаменить(ГУИД_Строки, "Вопрос_", "");
		ГУИД_Строки = СтрЗаменить(ГУИД_Строки, "_", "-");
		
		ГУИД = Новый УникальныйИдентификатор(ГУИД_Строки);
		
		мСтроки = ОтветыНаВопросы.НайтиСтроки(Новый Структура("КлючСтроки", ГУИД));					
		
		Если мСтроки.Количество() > 0 Тогда 
			текСтрока = мСтроки[0];
			Если текСтрока.ИсключитьВопрос Тогда 
				ВопросДоступен = Ложь;
			КонецЕсли;
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого текЭлемент Из Элемент.Родитель.ПодчиненныеЭлементы Цикл 
		Если текЭлемент <> Элемент Тогда 
			текЭлемент.Доступность = ВопросДоступен;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Функция ЗаписатьАнкетыНаСервере(РежимЗаписи, Отказ = Ложь)
	
	НачатьТранзакцию();
		
	МассивРезультатов = Новый Массив;	
	МассивРезультатов.Добавить(ЗаписатьАнкету(Объект, РежимЗаписи, Отказ));
	
	Если Не Отказ И ДопШаблон_Использовать Тогда 
		МассивРезультатов.Добавить(ЗаписатьАнкету(ДопШаблон_Объект, РежимЗаписи, Отказ));
	КонецЕсли;
	
	Если Не Отказ Тогда 
		ЗафиксироватьТранзакцию();
	Иначе
		ОтменитьТранзакцию();
	КонецЕсли;
	
	Возврат МассивРезультатов;
	
КонецФункции

&НаКлиенте
Процедура ПровестиИЗакрытьАнкеты(Команда)
	
	Отказ = Ложь;
	
	мРезультаты = ЗаписатьАнкетыНаСервере(РежимЗаписиДокумента.Проведение, Отказ);
	
	Если Не Отказ Тогда 
		ЭтаФорма.Закрыть(мРезультаты);
	Иначе
		Для Каждого Результат Из мРезультаты Цикл 
			Если Результат.Свойство("Сообщение") Тогда 
				ОбщегоНазначенияКлиент.СообщитьПользователю(
					Результат.Сообщение,
					?(Результат.Свойство("Ссылка"), Результат.Ссылка, Неопределено));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаписатьАнкету(АнкетаОбъект, РежимЗаписи, Отказ)
	
	Результат = Новый Структура;
	
	Попытка
		докОбъект = Документы.Анкета.СоздатьДокумент();
		докОбъект.Заполнить(АнкетаОбъект);
		
		ПередЗаписьюАнкеты(докОбъект);
		докОбъект.Записать(РежимЗаписи, РежимПроведенияДокумента.Оперативный);
		
		Результат.Вставить("Ссылка", докОбъект.Ссылка);
		
		Результат.Вставить("Сообщение", СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 документ %2'; uk = '%1 документ %2'"),
				?(РежимЗаписи = РежимЗаписиДокумента.Проведение, НСтр("ru = 'Проведен'; uk = 'Проведений'"), НСтр("ru = 'Записан'; uk = 'Записаний'")),
				Строка(докОбъект.Ссылка)));
	Исключение
		Отказ = Истина;
		Результат.Вставить("Сообщение", ОписаниеОшибки());
	КонецПопытки;		
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПередЗаписьюАнкеты(ТекущийОбъект)	
	
	ШаблонАнкеты = ТекущийОбъект.ШаблонАнкеты;
	
	тзОтветы = ОтветыНаВопросы.Выгрузить(Новый Структура("ШаблонАнкеты", ШаблонАнкеты));
	Для Каждого Стр Из тзОтветы Цикл 
		Стр.НомерЯчейки = ?(Стр.ИсключитьВопрос, 1, 0);
	КонецЦикла;	
	
	ТекущийОбъект.Состав.Загрузить(тзОтветы);
	
	ТекущийОбъект.ДатаРедактирования = ТекущаяДатаСеанса();	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	Если ТекущийОбъект.Интервьюер.Пустая() Тогда 
		ТекущийОбъект.Интервьюер = ТекущийПользователь;
	КонецЕсли;
		
КонецПроцедуры


&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияТК.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуВопросвРекурсивно(ДеревоСтроки, Шаблон);
	
	Для Каждого Строка Из ДеревоСтроки Цикл 
		
		Если Строка.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовШаблонаАнкеты.Простой") Тогда 
			НоваяСтрока = ОтветыНаВопросы.Добавить();
			НоваяСтрока.КлючСтроки = Строка.КлючСтроки;
			НоваяСтрока.Вопрос = Строка.ВопросШаблона;			
			НоваяСтрока.ЭлементарныйВопрос = Строка.ЭлементарныйВопрос;
			НоваяСтрока.ШаблонАнкеты = Шаблон;			
		КонецЕсли;
		
		ПодчиненныеСтроки = Строка.Строки;
		Если ПодчиненныеСтроки.Количество() > 0 Тогда 
			ЗаполнитьТаблицуВопросвРекурсивно(ПодчиненныеСтроки, Шаблон);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьВопросыАнкеты(ИмяЭлемента, ЭлементГруппаВопросы);
	
	ДеревоАнкетыСервер = РеквизитФормыВЗначение(ИмяЭлемента, Тип("ДеревоЗначений"));
	
	ДобавитьВопросыРекурсивно(ДеревоАнкетыСервер.Строки, ЭлементГруппаВопросы);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВопросыРекурсивно(Дерево, ЭлементГруппаВопросы)
	
	Для Каждого Стр Из Дерево Цикл 		
		
		ИмяВопроса = АнкетированиеКлиентСервер.ПолучитьИмяВопроса(Стр.КлючСтроки);		
		
		Если Стр.ТипСтроки = "Раздел" Тогда 					
			
			НовыйЭлемент = Элементы.Добавить(ИмяВопроса, Тип("ДекорацияФормы"), ЭлементГруппаВопросы);
			НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
			НовыйЭлемент.Заголовок = "Раздел " + Лев(Стр.ПолныйКод, 1) + ". " + Стр.Формулировка;
			НовыйЭлемент.ЦветТекста = ЦветаСтиля.ЦветРазделаПанелиФункций;
			НовыйЭлемент.Шрифт = ШрифтыСтиля.КрупныйШрифтТекста;
			
		ИначеЕсли Стр.ТипСтроки = "Вопрос" Тогда 
			
			ДобавитьВопрос = Истина;
			
			ЭтоЧисло = Стр.ТипОтвета = ПредопределенноеЗначение("Перечисление.ТипыОтветовНаВопрос.Число");
			ЭтоБулево = Стр.ТипОтвета = ПредопределенноеЗначение("Перечисление.ТипыОтветовНаВопрос.Булево");
			
			Если Не ЭтоЧисло И Не ЭтоБулево Тогда 
				ДобавитьВопрос = Ложь;
			КонецЕсли;

			Если ДобавитьВопрос Тогда 
				МассивВопросов = ОтветыНаВопросы.НайтиСтроки(Новый Структура("КлючСтроки", Стр.КлючСтроки));				
				Если МассивВопросов.Количество() = 0 Тогда 
					ДобавитьВопрос = Ложь;
				КонецЕсли;
				
				СтрОтвет = МассивВопросов[0];				
				ИД = СтрОтвет.ПолучитьИдентификатор();			
								
				ДобавитьЭлементыВопрос(Стр, ЭлементГруппаВопросы, ЭтаФорма, ИД);																			
			КонецЕсли;
						
		КонецЕсли;
		
		ПодчиненныеСтроки = Стр.Строки;
		Если ПодчиненныеСтроки.Количество() > 0 Тогда 
			ДобавитьВопросыРекурсивно(ПодчиненныеСтроки, ЭлементГруппаВопросы);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьПредставлениеКлючаСтроки(Знач ГУИДСтроки)
	
	Возврат СтрЗаменить(СокрЛП(Строка(ГУИДСтроки)), "-", "_");
	
КонецФункции

&НаСервере
Процедура ДобавитьЭлементыВопрос(СтрокаТаблицы,ЭлементГруппа,Форма, ИД)
	
	Если СтрокаТаблицы.ТипВопроса = Перечисления.ТипыВопросовШаблонаАнкеты.Табличный 
		ИЛИ СтрокаТаблицы.ТипВопроса = Перечисления.ТипыВопросовШаблонаАнкеты.Комплексный Тогда
		
		Возврат;
	КонецЕсли;
	
	ИмяВопроса = АнкетированиеКлиентСервер.ПолучитьИмяВопроса(СтрокаТаблицы.КлючСтроки);
	ПутьКДанным = "ОтветыНаВопросы[" + ИД + "].Ответ";
	ПутьККомментарий = "ОтветыНаВопросы[" + ИД + "].ОткрытыйОтвет";
	ПутьКИсключению = "ОтветыНаВопросы[" + ИД + "].ИсключитьВопрос";
	
	// Зададим элемент группы для вопроса.
	ЭлементГруппаВопроса = Форма.Элементы.Добавить(ИмяВопроса + "_Группа" ,Тип("ГруппаФормы"),ЭлементГруппа);
	ЭлементГруппаВопроса.Вид                        = ВидГруппыФормы.ОбычнаяГруппа;
	ЭлементГруппаВопроса.ОтображатьЗаголовок        = Ложь;
	ЭлементГруппаВопроса.Отображение                = ОтображениеОбычнойГруппы.Нет;
	ЭлементГруппаВопроса.Группировка                = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ЭлементГруппаВопроса.РастягиватьПоГоризонтали   = Истина;
	ЭлементГруппаВопроса.РастягиватьПоВертикали     = Ложь;
		
	Если СтрокаТаблицы.ТипОтвета = Перечисления.ТипыОтветовНаВопрос.Булево Тогда
		
		ЭлементГруппаВопросаБулево = Форма.Элементы.Добавить(
			ИмяВопроса + "_Группа_Булево" ,Тип("ГруппаФормы"),ЭлементГруппаВопроса);
		ЭлементГруппаВопросаБулево.Вид                        = ВидГруппыФормы.ОбычнаяГруппа;
		ЭлементГруппаВопросаБулево.ОтображатьЗаголовок        = Ложь;
		ЭлементГруппаВопросаБулево.Отображение                = ОтображениеОбычнойГруппы.Нет;
		ЭлементГруппаВопросаБулево.Группировка                = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ЭлементГруппаВопросаБулево.РастягиватьПоГоризонтали   = Истина;
		ЭлементГруппаВопросаБулево.РастягиватьПоВертикали     = Ложь;
		
	КонецЕсли;
		    
	Если СтрокаТаблицы.ТипОтвета = Перечисления.ТипыОтветовНаВопрос.Булево Тогда
		Элемент = Форма.Элементы.Добавить(
			ИмяВопроса + "_Формулировка", Тип("ДекорацияФормы"), ЭлементГруппаВопросаБулево);
	Иначе
		Элемент = Форма.Элементы.Добавить(
			ИмяВопроса + "_Формулировка", Тип("ДекорацияФормы"), ЭлементГруппаВопроса); // РасширениеДекорацииФормыДляНадписи
	КонецЕсли;
	Элемент.Вид                      = ВидДекорацииФормы.Надпись;
	Элемент.ВертикальноеПоложение    = ВертикальноеПоложениеЭлемента.Верх;
	Элемент.Заголовок                = ПолныйКодНаименование(СтрокаТаблицы);
	Элемент.АвтоМаксимальнаяШирина   = Ложь;
	Элемент.МаксимальнаяШирина       = 100;
	Элемент.РастягиватьПоГоризонтали = Ложь;
	Элемент.РастягиватьПоВертикали   = Ложь;
	Элемент.Подсказка                = СтрокаТаблицы.Подсказка;
	
	
	Если Не СтрокаТаблицы.Обязательный Тогда 
		
		ОписаниеТипа = Новый ОписаниеТипов("Булево");					
		
		Элемент = Форма.Элементы.Добавить(ИмяВопроса + "_ИсключитьВопрос",Тип("ПолеФормы"),ЭлементГруппаВопроса);
		Элемент.Вид = ВидПоляФормы.ПолеФлажка;
		Элемент.ВидФлажка = ВидФлажка.Выключатель;
		Элемент.ОграничениеТипа    = ОписаниеТипа;
		Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		Элемент.ПутьКДанным        = ПутьКИсключению;		
		Элемент.УстановитьДействие("ПриИзменении", "ИсключениеВопросаПриИзменении");
			
	КонецЕсли;	
	
	
	Если СтрокаТаблицы.СпособОтображенияПодсказки = Перечисления.СпособыОтображенияПодсказок.ЗнакВопросаСправа Тогда
		Элемент.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
	Иначе
		Элемент.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	КонецЕсли;
	
	ЭлементГруппаВопросКомментарий = Форма.Элементы.Добавить(ИмяВопроса + "_Группа_Вопрос_Комментарий",Тип("ГруппаФормы"),ЭлементГруппаВопроса);
	ЭлементГруппаВопросКомментарий.Вид                 = ВидГруппыФормы.ОбычнаяГруппа;
	ЭлементГруппаВопросКомментарий.Отображение         = ОтображениеОбычнойГруппы.Нет;
	ЭлементГруппаВопросКомментарий.Группировка         = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ЭлементГруппаВопросКомментарий.ОтображатьЗаголовок = Ложь;
	
	Если СтрокаТаблицы.ТипВопроса = Перечисления.ТипыВопросовШаблонаАнкеты.Табличный Тогда
		
		//ДобавитьЭлементыТабличныйВопрос(СтрокаТаблицы,ЭлементГруппаВопроса,Форма);
				
	ИначеЕсли СтрокаТаблицы.ТипВопроса = Перечисления.ТипыВопросовШаблонаАнкеты.Комплексный Тогда
		
		//ДобавитьЭлементыКомплексныйВопрос(СтрокаТаблицы,ЭлементГруппаВопроса,Форма);
		
	Иначе
		
		Если СтрокаТаблицы.ТипОтвета = Перечисления.ТипыОтветовНаВопрос.Строка Тогда
			
			Элемент = Форма.Элементы.Добавить(ИмяВопроса,Тип("ПолеФормы"),ЭлементГруппаВопросКомментарий);
			Элемент.Вид                        = ВидПоляФормы.ПолеВвода;
			Элемент.ПоложениеЗаголовка         = ПоложениеЗаголовкаЭлементаФормы.Нет;
			Элемент.АвтоОтметкаНезаполненного  = СтрокаТаблицы.Обязательный;
			Элемент.ПутьКДанным                = ПутьКДанным;
			Элемент.АвтоМаксимальнаяШирина     = Ложь;
			Элемент.РастягиватьПоГоризонтали   = Ложь;
			
		ИначеЕсли СтрокаТаблицы.ТипОтвета = Перечисления.ТипыОтветовНаВопрос.Текст Тогда
			
			Элемент = Форма.Элементы.Добавить(ИмяВопроса,Тип("ПолеФормы"),ЭлементГруппаВопросКомментарий);
			Элемент.Вид                       = ВидПоляФормы.ПолеВвода;
			Элемент.ПоложениеЗаголовка        = ПоложениеЗаголовкаЭлементаФормы.Нет;
			Элемент.АвтоОтметкаНезаполненного = СтрокаТаблицы.Обязательный;
			Элемент.ПутьКДанным               = ПутьКДанным;
			Элемент.РастягиватьПоВертикали    = Ложь;
			Элемент.АвтоМаксимальнаяШирина    = Ложь;
			Анкетирование.УстановитьПараметрыЭлементаЯчейкаТекст(Элемент); 
			
		ИначеЕсли СтрокаТаблицы.ТипОтвета = Перечисления.ТипыОтветовНаВопрос.Булево Тогда  //
			
			ОписаниеТипа = Новый ОписаниеТипов("Булево");					
						
			Элемент = Форма.Элементы.Добавить(ИмяВопроса,Тип("ПолеФормы"), ЭлементГруппаВопросаБулево);
			Элемент.Вид = ВидПоляФормы.ПолеВвода;			
			Элемент.ОграничениеТипа    = ОписаниеТипа;
			Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			Элемент.ПутьКДанным        = ПутьКДанным;
			
			Элемент.РастягиватьПоГоризонтали = Ложь;
						
			СтрОтвет = ОтветыНаВопросы.НайтиПоИдентификатору(ИД);
			СтрОтвет.Ответ = Элемент.ОграничениеТипа.ПривестиЗначение(СтрОтвет.Ответ);			
						
		ИначеЕсли СтрокаТаблицы.ТипОтвета = Перечисления.ТипыОтветовНаВопрос.Дата Тогда
			
			Элемент = Форма.Элементы.Добавить(ИмяВопроса,Тип("ПолеФормы"),ЭлементГруппаВопросКомментарий);
			Элемент.Вид                       = ВидПоляФормы.ПолеВвода;
			Элемент.ПоложениеЗаголовка        = ПоложениеЗаголовкаЭлементаФормы.Нет;
			Элемент.АвтоОтметкаНезаполненного = СтрокаТаблицы.Обязательный;
			Элемент.ПутьКДанным               = ПутьКДанным;
			Элемент.АвтоМаксимальнаяШирина    = Ложь;
			
		ИначеЕсли СтрокаТаблицы.ТипОтвета = Перечисления.ТипыОтветовНаВопрос.Число Тогда //
			
			ОписаниеТипа = ОбщегоНазначения.ОписаниеТипаЧисло(СтрокаТаблицы.Длина, СтрокаТаблицы.Точность, ДопустимыйЗнак.Неотрицательный);		
			
			Элемент = Форма.Элементы.Добавить(ИмяВопроса,Тип("ПолеФормы"),ЭлементГруппаВопросКомментарий);
			Элемент.Вид                       = ВидПоляФормы.ПолеВвода;
			Элемент.ПоложениеЗаголовка        = ПоложениеЗаголовкаЭлементаФормы.Нет;
			Элемент.АвтоОтметкаНезаполненного = СтрокаТаблицы.Обязательный;
			Элемент.МинимальноеЗначение       = ?(СтрокаТаблицы.МинимальноеЗначение = 0,Неопределено,СтрокаТаблицы.МинимальноеЗначение);
			Элемент.МаксимальноеЗначение      = ?(СтрокаТаблицы.МаксимальноеЗначение = 0,Неопределено,СтрокаТаблицы.МаксимальноеЗначение);
			Элемент.КнопкаВыбора              = Ложь;
			Элемент.ПутьКДанным               = ПутьКДанным;
			Элемент.АвтоМаксимальнаяШирина    = Ложь;
			Элемент.РастягиватьПоГоризонтали  = Ложь;
			Элемент.Ширина = 3;
			Элемент.ОграничениеТипа    = ОписаниеТипа;
			
			СтрОтвет = ОтветыНаВопросы.НайтиПоИдентификатору(ИД);
			СтрОтвет.Ответ = Элемент.ОграничениеТипа.ПривестиЗначение(СтрОтвет.Ответ);			
			
			Если СтрокаТаблицы.МинимальноеЗначение <> 0 ИЛИ СтрокаТаблицы.МаксимальноеЗначение <> 0 Тогда
				Элемент.КнопкаРегулирования = Истина;
				
				ТекстПодсказки = "";
				Если СтрокаТаблицы.МинимальноеЗначение <> 0 И СтрокаТаблицы.МаксимальноеЗначение <> 0 Тогда
					ТекстПодсказки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Допустим ввод значения от %1 до %2'"),
						СтрокаТаблицы.МинимальноеЗначение, СтрокаТаблицы.МаксимальноеЗначение);
				ИначеЕсли СтрокаТаблицы.МинимальноеЗначение = 0 И СтрокаТаблицы.МаксимальноеЗначение <> 0 Тогда
					ТекстПодсказки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Допустим ввод значения до %1'"), СтрокаТаблицы.МаксимальноеЗначение);
				Иначе
					ТекстПодсказки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Допустим ввод значения от %1'"), СтрокаТаблицы.МинимальноеЗначение);
				КонецЕсли;
				
				Элемент.Подсказка = ТекстПодсказки;
				
			КонецЕсли;
			
		ИначеЕсли СтрокаТаблицы.ТипОтвета = Перечисления.ТипыОтветовНаВопрос.ЗначениеИнформационнойБазы Тогда
			
			Элемент = Форма.Элементы.Добавить(ИмяВопроса,Тип("ПолеФормы"),ЭлементГруппаВопросКомментарий);
			Элемент.Вид                        = ВидПоляФормы.ПолеВвода;
			Элемент.ПоложениеЗаголовка         = ПоложениеЗаголовкаЭлементаФормы.Нет;
			Элемент.АвтоОтметкаНезаполненного  = СтрокаТаблицы.Обязательный;
			Элемент.ПутьКДанным                = ПутьКДанным;
			Элемент.АвтоМаксимальнаяШирина     = Ложь;
			Элемент.РастягиватьПоГоризонтали   = Ложь;
			
		ИначеЕсли СтрокаТаблицы.ТипОтвета = Перечисления.ТипыОтветовНаВопрос.ОдинВариантИз Тогда
			
			ВариантыОтветовНаВопрос = Анкетирование.ПолучитьВариантыОтветовНаВопрос(СтрокаТаблицы.ЭлементарныйВопрос,Форма);
			
			Элемент = Форма.Элементы.Добавить(ИмяВопроса,Тип("ПолеФормы"),ЭлементГруппаВопросКомментарий);
			Элемент.Вид                     = ВидПоляФормы.ПолеПереключателя;
			Элемент.ПоложениеЗаголовка      = ПоложениеЗаголовкаЭлементаФормы.Нет;
			Элемент.ПутьКДанным             = ПутьКДанным;
			Элемент.КоличествоКолонок       = 1;
			Элемент.ВысотаЭлемента          = 1;
			Элемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Лево;
			
			Если СтрокаТаблицы.ВидПереключателя = Перечисления.ВидыПереключателяВАнкетах.Тумблер Тогда
				Элемент.ВидПереключателя = ВидПереключателя.Тумблер;
				Элемент.КоличествоКолонок = 0;
				Элемент.ОдинаковаяШиринаКолонок = Ложь;
			Иначе
				Элемент.ВидПереключателя = ВидПереключателя.Переключатель;
				Элемент.КоличествоКолонок = 1;
			КонецЕсли;
			
			Для каждого ВариантОтвета Из ВариантыОтветовНаВопрос Цикл
				СписокВыбораЭлемента = Элемент.СписокВыбора; // СписокЗначений
				СписокВыбораЭлемента.Добавить(ВариантОтвета.Ответ,ВариантОтвета.Представление);
			КонецЦикла;
			
		ИначеЕсли СтрокаТаблицы.ТипОтвета = Перечисления.ТипыОтветовНаВопрос.НесколькоВариантовИз Тогда
			
			ВариантыОтветовНаВопрос = Анкетирование.ПолучитьВариантыОтветовНаВопрос(СтрокаТаблицы.ЭлементарныйВопрос,Форма);
			Счетчик = 0;
			
			ЭлементГруппаВариантыОтветов = Форма.Элементы.Добавить(ИмяВопроса + "_Группа_Варианты",Тип("ГруппаФормы"),ЭлементГруппаВопросКомментарий);
			
			ЭлементГруппаВариантыОтветов.Вид                 = ВидГруппыФормы.ОбычнаяГруппа;
			ЭлементГруппаВариантыОтветов.Отображение         = ОтображениеОбычнойГруппы.Нет;
			ЭлементГруппаВариантыОтветов.Группировка         = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			ЭлементГруппаВариантыОтветов.ОтображатьЗаголовок = Ложь;
			
			Для каждого ВариантОтвета Из ВариантыОтветовНаВопрос Цикл
				
				Счетчик = Счетчик + 1;
				
				ЭлементГруппаВариантОтвета = Форма.Элементы.Добавить(ИмяВопроса + "_Группа_ВариантОтвета_" + XMLСтрока(Счетчик),
					Тип("ГруппаФормы"), ЭлементГруппаВариантыОтветов);
				
				ЭлементГруппаВариантОтвета.Вид                        = ВидГруппыФормы.ОбычнаяГруппа;
				ЭлементГруппаВариантОтвета.Отображение                = ОтображениеОбычнойГруппы.Нет;
				ЭлементГруппаВариантОтвета.Группировка                = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
				ЭлементГруппаВариантОтвета.ОтображатьЗаголовок        = Ложь;
				ЭлементГруппаВариантОтвета.РастягиватьПоГоризонтали   = Истина;
				
				ИмяРеквизитаВопроса = ИмяВопроса + "_Реквизит_" + Счетчик;
				Элемент = Форма.Элементы.Добавить(ИмяРеквизитаВопроса,Тип("ПолеФормы"),ЭлементГруппаВариантОтвета);
				
				Элемент.Вид                = ВидПоляФормы.ПолеФлажка;
				Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
				Элемент.ПутьКДанным        = ПутьКДанным;
				Элемент.ВысотаЗаголовка    = 1;
				
				Если ВариантОтвета.ТребуетОткрытогоОтвета Тогда
					ИмяРеквизитаКомментария = ИмяВопроса + "_Комментарий_" + Счетчик;
					Элемент = Форма.Элементы.Добавить(ИмяРеквизитаКомментария,Тип("ПолеФормы"),ЭлементГруппаВариантОтвета);
					Элемент.Вид 		= ВидПоляФормы.ПолеФлажка;
					Элемент.ПутьКДанным	= ПутьКДанным;
					Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		// Комментарии к вопросам
		Если (СтрокаТаблицы.ТипОтвета <> Перечисления.ТипыОтветовНаВопрос.НесколькоВариантовИз) И (СтрокаТаблицы.ТребуетсяКомментарий) Тогда
			
			Элемент                        = Форма.Элементы.Добавить(ИмяВопроса + "_Комментарий",Тип("ПолеФормы"),ЭлементГруппаВопросКомментарий);
			Элемент.Вид                    = ВидПоляФормы.ПолеВвода;
			Элемент.ПутьКДанным            = ПутьККомментарий;
			Элемент.АвтоМаксимальнаяШирина = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолныйКодНаименование(СтрокаТаблицы)

	Возврат ?(СтрокаТаблицы.ТипСтроки = "Раздел","Раздел ","") + СтрокаТаблицы.ПолныйКод + " "
		+ ?(СтрокаТаблицы.ТипСтроки="Раздел", СтрокаТаблицы.Наименование, СтрокаТаблицы.Формулировка);

КонецФункции

&НаСервере
Процедура ЗаполнитьСохраненныеОтветыНаВопросы()
	
	Если Объект.Состав.Количество() = 0 ИЛИ ОтветыНаВопросы.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	МассивИсключений = Новый Массив;
	
	Для Каждого Стр Из Объект.Состав Цикл 
		
		СтруктураОтбора = Новый Структура("Вопрос,ЭлементарныйВопрос");
		ЗаполнитьЗначенияСвойств(СтруктураОтбора, Стр);		
		МассивВопросов = ОтветыНаВопросы.НайтиСтроки(СтруктураОтбора);
		
		Если МассивВопросов.Количество() = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		СтрОтвет = МассивВопросов[0];
		ЗаполнитьЗначенияСвойств(СтрОтвет, Стр, "Ответ, ОткрытыйОтвет, НомерЯчейки");
		
		Если СтрОтвет.НомерЯчейки <> 0 Тогда 
			СтрОтвет.ИсключитьВопрос = Истина;
			
			МассивИсключений.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
										"Вопрос_%1_ИсключитьВопрос",
										СтрЗаменить(Строка(СтрОтвет.КлючСтроки), "-", "_")));
										
		КонецЕсли;		
	КонецЦикла;
	
	Если МассивИсключений.Количество() > 0 Тогда 
		СписокЭлементовИсключений.ЗагрузитьЗначения(МассивИсключений);
	КонецЕсли;
	
КонецПроцедуры



#КонецОбласти


#Область РаботаСБуферомОбмена


#КонецОбласти
